---
type: FamilySymbolProfile
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# FamilySymbolProfile

`Autodesk.Revit.DB.FamilySymbolProfile` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Angle | — | `public double Angle { get ; set ; }` |
| Property | IsFlipped | — | `public bool IsFlipped { get ; set ; }` |
| Property | Profile | — | `public FamilySymbol Profile { get ; set ; }` |
| Property | XOffset | — | `public double XOffset { get ; set ; }` |
| Property | YOffset | — | `public double YOffset { get ; set ; }` |